docs/memoire.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-24 Thu 22:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>moindres carrés dans la prévision de consommation d&rsquo;électricité</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="frederic boileau" />
</head>
<body>
<div id="content">
<h1 class="title">moindres carrés dans la prévision de consommation d&rsquo;électricité</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org133d2a2">1. fortran code enlsip</a>
<ul>
<li><a href="#org812428a">1.1. variables</a></li>
</ul>
</li>
<li><a href="#orgb2e3296">2. lit review of least square models</a>
<ul>
<li><a href="#org5c10d1c">2.1. <span class="todo TODO">TODO</span> Liste des publications pertinentes <code>[0/10]</code></a></li>
<li><a href="#orgff64d4e">2.2. <span class="todo TODO">TODO</span> Approches pour faire face aux contraintes</a>
<ul>
<li><a href="#orgfcbff74">2.2.1. projection</a></li>
<li><a href="#orga1c89c6">2.2.2. trust region</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org83ad3ad">3. <span class="todo TODO">TODO</span> julia code</a>
<ul>
<li><a href="#org49d8634">3.1. lsqfit</a>
<ul>
<li><a href="#org1423444">3.1.1. test</a></li>
</ul>
</li>
<li><a href="#org37f3b87">3.2. statsbase</a></li>
</ul>
</li>
<li><a href="#orgbcd0749">4. data</a></li>
<li><a href="#org3b42381">5. publishing options</a></li>
</ul>
</div>
</div>

<div id="outline-container-org133d2a2" class="outline-2">
<h2 id="org133d2a2"><span class="section-number-2">1</span> fortran code enlsip</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org812428a" class="outline-3">
<h3 id="org812428a"><span class="section-number-3">1.1</span> variables</h3>
<div class="outline-text-3" id="text-1-1">
<p>
FEX65 and HEX65 are user written subroutines
<i>BACK</i> is name of common block for variables :
BESTRK, BESTPGG, NRREST, LATTRY
</p>

<div class="org-src-container">
<pre class="src src-fortran">    <span style="color: #fabd2f;">EXTERNAL</span> <span style="color: #8ec07c;">FEX65</span>,<span style="color: #8ec07c;">HEX65</span>
    <span style="color: #fabd2f;">INTEGER</span> <span style="color: #8ec07c;">N</span>,<span style="color: #8ec07c;">M</span>,<span style="color: #8ec07c;">P</span>,<span style="color: #8ec07c;">L</span>
    <span style="color: #fabd2f;">INTEGER</span> <span style="color: #8ec07c;">EXIT</span>
    <span style="color: #fabd2f;">INTEGER</span> <span style="color: #8ec07c;">ACTIVE</span>(<span style="color: #d3869b; font-weight: bold;">10</span>),<span style="color: #8ec07c;">WINT</span>(<span style="color: #d3869b; font-weight: bold;">36</span>)
    <span style="color: #fabd2f;">DOUBLE PRECISION</span>
    *     H(<span style="color: #d3869b; font-weight: bold;">7</span>),X(<span style="color: #d3869b; font-weight: bold;">3</span>),F(<span style="color: #d3869b; font-weight: bold;">10</span>),WREAL(<span style="color: #d3869b; font-weight: bold;">136</span>)
    <span style="color: #fabd2f;">DOUBLE PRECISION</span>
    *    BESTRK,BESTPG
    <span style="color: #fabd2f;">INTEGER</span> <span style="color: #8ec07c;">NRREST</span>,<span style="color: #8ec07c;">LATTRY</span>
    <span style="color: #fabd2f;">COMMON</span> /<span style="color: #8ec07c;">BACK</span>/ BESTRK,BESTPG, NRREST,LATTRY
    MDI=<span style="color: #d3869b; font-weight: bold;">36</span>
    MDR=<span style="color: #d3869b; font-weight: bold;">136</span>
    NOUT=<span style="color: #d3869b; font-weight: bold;">10</span>
    N=<span style="color: #d3869b; font-weight: bold;">3</span>
    M=<span style="color: #d3869b; font-weight: bold;">3</span>
    P=<span style="color: #d3869b; font-weight: bold;">0</span>
    L=<span style="color: #d3869b; font-weight: bold;">7</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgb2e3296" class="outline-2">
<h2 id="orgb2e3296"><span class="section-number-2">2</span> lit review of least square models</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5c10d1c" class="outline-3">
<h3 id="org5c10d1c"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Liste des publications pertinentes <code>[0/10]</code></h3>
</div>
<div id="outline-container-orgff64d4e" class="outline-3">
<h3 id="orgff64d4e"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Approches pour faire face aux contraintes</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgfcbff74" class="outline-4">
<h4 id="orgfcbff74"><span class="section-number-4">2.2.1</span> projection</h4>
</div>
<div id="outline-container-orga1c89c6" class="outline-4">
<h4 id="orga1c89c6"><span class="section-number-4">2.2.2</span> trust region</h4>
</div>
</div>
</div>

<div id="outline-container-org83ad3ad" class="outline-2">
<h2 id="org83ad3ad"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> julia code</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org49d8634" class="outline-3">
<h3 id="org49d8634"><span class="section-number-3">3.1</span> lsqfit</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="./juliaPackages/LsqFit.jl/src/curve_fit.jl">./juliaPackages/LsqFit.jl/src/curve_fit.jl</a>
</p>

<p>
P : parameter, abstract
R : residual, abstract
J: jacobian, abstract
W : weight , abstract array
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #fb4934;">struct</span> <span style="color: #fabd2f;">LsqFitResult</span>{P, R, J, W <span style="color: #fabd2f;">&lt;:</span> <span style="color: #fabd2f;">AbstractArray</span>}
    param<span style="color: #fabd2f;">::P</span>
    resid<span style="color: #fabd2f;">::R</span>
    jacobian<span style="color: #fabd2f;">::J</span>
    converged<span style="color: #fabd2f;">::Bool</span>
    wt<span style="color: #fabd2f;">::W</span>
<span style="color: #fb4934;">end</span>
</pre>
</div>



<div class="org-src-container">
<pre class="src src-julia">StatsBase.<span style="color: #8ec07c;">coef</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = lfr.param
StatsBase.<span style="color: #8ec07c;">dof</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = nobs(lfr) <span style="color: #fabd2f;">-</span> length(coef(lfr))
StatsBase.<span style="color: #8ec07c;">nobs</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = length(lfr.resid)
StatsBase.<span style="color: #8ec07c;">rss</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = sum(abs2, lfr.resid)
StatsBase.<span style="color: #8ec07c;">weights</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = lfr.wt
StatsBase.<span style="color: #8ec07c;">residuals</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = lfr.resid
<span style="color: #8ec07c;">mse</span>(lfr<span style="color: #fabd2f;">::LsqFitResult</span>) = rss(lfr)<span style="color: #fabd2f;">/</span>dof(lfr)
</pre>
</div>

<p>
dof: degrees of freedom
nobs: number of independent obersations on which the model was defined
rss: residual sum of squares
</p>


<div class="org-src-container">
<pre class="src src-julia"><span style="color: #928374;"># </span><span style="color: #928374;">provide a method for those who have their own Jacobian function</span>
<span style="color: #fb4934;">function</span> <span style="color: #8ec07c;">lmfit</span>(f, g, p0<span style="color: #fabd2f;">::AbstractArray</span>, wt<span style="color: #fabd2f;">::AbstractArray</span>; kwargs...)
    r = f(p0)
    R = OnceDifferentiable(f, g, p0, similar(r); inplace=<span style="color: #d3869b;">false</span>)
    lmfit(R, p0, wt; kwargs...)
<span style="color: #fb4934;">end</span>
</pre>
</div>

<ul class="org-ul">
<li>apply f to get residuals</li>
<li>OnceDifferentiable, similar</li>
<li>lmfit(R, p0 wt; kwargs&#x2026;)</li>
</ul>
</div>

<div id="outline-container-org1423444" class="outline-4">
<h4 id="org1423444"><span class="section-number-4">3.1.1</span> test</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
x: array of independent variables
p: array of model parameters
apply to the full dataset with @.
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #fb4934;">using</span> LsqFit
@. model(x, p) = p[<span style="color: #d3869b; font-weight: bold;">1</span>]<span style="color: #fabd2f;">*</span>exp(<span style="color: #fabd2f;">-</span>x<span style="color: #fabd2f;">*</span>p[<span style="color: #d3869b; font-weight: bold;">2</span>])
xdata = range(<span style="color: #d3869b; font-weight: bold;">0</span>, stop=<span style="color: #d3869b; font-weight: bold;">10</span>, length=<span style="color: #d3869b; font-weight: bold;">20</span>)
ydata = model(xdata, [<span style="color: #d3869b; font-weight: bold;">1.0</span> , <span style="color: #d3869b; font-weight: bold;">2.0</span>]) <span style="color: #fabd2f;">+</span> <span style="color: #d3869b; font-weight: bold;">0.01</span><span style="color: #fabd2f;">*</span>randn(length(xdata))
p0 = [<span style="color: #d3869b; font-weight: bold;">0.5</span>, <span style="color: #d3869b; font-weight: bold;">0.5</span>];
</pre>
</div>

<p>
t is a composite type (LsqFitResult), with some interesting values:
dof(fit): degrees of freedom
coef(fit): best fit parameters
fit.resid: residuals = vector of residuals
fit.jacobian: estimated Jacobian at solution
</p>
<div class="org-src-container">
<pre class="src src-julia">fit = curve_fit(model, xdata, yadata, p0)
lb = [<span style="color: #d3869b; font-weight: bold;">1.1</span>, <span style="color: #fabd2f;">-</span><span style="color: #d3869b; font-weight: bold;">0.5</span>]
ub = [<span style="color: #d3869b; font-weight: bold;">1.9</span>, <span style="color: #d3869b;">Inf</span>]
p0_bounds = [<span style="color: #d3869b; font-weight: bold;">1.2</span>, <span style="color: #d3869b; font-weight: bold;">1.2</span>] <span style="color: #928374;"># </span><span style="color: #928374;">we have to start inside the bounds</span>
<span style="color: #928374;"># </span><span style="color: #928374;">Optional upper and/or lower bounds on the free parameters can be passed as an argument.</span>
<span style="color: #928374;"># </span><span style="color: #928374;">Bounded and unbouded variables can be mixed by setting `-Inf` if no lower bounds</span>
<span style="color: #928374;"># </span><span style="color: #928374;">is to be enforced for that variable and similarly for `+Inf`</span>
fit_bounds = curve_fit(model, xdata, ydata, p0_bounds, lower=lb, upper=ub)

<span style="color: #928374;"># </span><span style="color: #928374;">We can estimate errors on the fit parameters,</span>
<span style="color: #928374;"># </span><span style="color: #928374;">to get standard error of each parameter:</span>
sigma = stderror(fit)
<span style="color: #928374;"># </span><span style="color: #928374;">to get margin of error and confidence interval of each parameter at 5% significance level:</span>
margin_of_error = margin_error(fit, <span style="color: #d3869b; font-weight: bold;">0.05</span>)
confidence_inter = confidence_interval(fit, <span style="color: #d3869b; font-weight: bold;">0.05</span>)

<span style="color: #928374;"># </span><span style="color: #928374;">The finite difference method is used above to approximate the Jacobian.</span>
<span style="color: #928374;"># </span><span style="color: #928374;">Alternatively, a function which calculates it exactly can be supplied instead.</span>
<span style="color: #fb4934;">function</span> <span style="color: #8ec07c;">jacobian_model</span>(x,p)
    J = Array{Float64}(<span style="color: #d3869b;">undef</span>, length(x), length(p))
    @. J[:,<span style="color: #d3869b; font-weight: bold;">1</span>] = exp(<span style="color: #fabd2f;">-</span>x<span style="color: #fabd2f;">*</span>p[<span style="color: #d3869b; font-weight: bold;">2</span>])     <span style="color: #928374;">#</span><span style="color: #928374;">dmodel/dp[1]</span>
    @. <span style="color: #8ec07c; font-weight: bold;">@views</span> J[:,<span style="color: #d3869b; font-weight: bold;">2</span>] = <span style="color: #fabd2f;">-</span>x<span style="color: #fabd2f;">*</span>p[<span style="color: #d3869b; font-weight: bold;">1</span>]<span style="color: #fabd2f;">*</span>J[:,<span style="color: #d3869b; font-weight: bold;">1</span>] <span style="color: #928374;">#</span><span style="color: #928374;">dmodel/dp[2], thanks to @views we don't allocate memory for the J[:,1] slice</span>
    J
<span style="color: #fb4934;">end</span>
fit = curve_fit(model, jacobian_model, xdata, ydata, p0)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org37f3b87" class="outline-3">
<h3 id="org37f3b87"><span class="section-number-3">3.2</span> statsbase</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="./juliaPackages/StatsBase.jl/src/statmodels.jl">./juliaPackages/StatsBase.jl/src/statmodels.jl</a>
</p>
</div>
</div>
</div>


<div id="outline-container-orgbcd0749" class="outline-2">
<h2 id="orgbcd0749"><span class="section-number-2">4</span> data</h2>
</div>

<div id="outline-container-org3b42381" class="outline-2">
<h2 id="org3b42381"><span class="section-number-2">5</span> publishing options</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #fb4934;">(</span><span style="color: #fb4934;">setq</span> <span style="color: #8ec07c;">org-publish-project-alist</span>
      <span style="color: #8ec07c;">'</span><span style="color: #fabd2f;">(</span><span style="color: #8ec07c;">(</span><span style="color: #b8bb26;">"memoir-org"</span>
         <span style="color: #fe8019;">:base-directory</span> <span style="color: #b8bb26;">"~/memoire"</span>
         <span style="color: #fe8019;">:base-extension</span> <span style="color: #b8bb26;">"org"</span>
         <span style="color: #fe8019;">:publishing-directory</span> <span style="color: #b8bb26;">"~/memoire/docs"</span>
         <span style="color: #fe8019;">:recursive</span> t
         <span style="color: #fe8019;">:exclude</span> <span style="color: #b8bb26;">"*/ignore/*"</span>
         <span style="color: #fe8019;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #fe8019;">:headline-levels</span> <span style="color: #d3869b; font-weight: bold;">4</span>             <span style="color: #928374;">; </span><span style="color: #928374;">Just the default for this project.</span>
         <span style="color: #fe8019;">:auto-preamble</span> t<span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #b8bb26;">"memoir-static"</span>
         <span style="color: #fe8019;">:base-directory</span> <span style="color: #b8bb26;">"~/memoire/"</span>
         <span style="color: #fe8019;">:base-extension</span> <span style="color: #b8bb26;">"css</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">js</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">png</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">jpg</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">gif</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">pdf</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">mp3</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">ogg</span><span style="color: #8ec07c; font-weight: bold;">\\</span><span style="color: #8ec07c; font-weight: bold;">|</span><span style="color: #b8bb26;">swf"</span>
         <span style="color: #fe8019;">:publishing-directory</span> <span style="color: #b8bb26;">"~/memoire/docs"</span>
         <span style="color: #fe8019;">:recursive</span> t
         <span style="color: #fe8019;">:publishing-function</span> org-publish-attachment<span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #b8bb26;">"memoir"</span> <span style="color: #fe8019;">:components</span> <span style="color: #fb4934;">(</span><span style="color: #b8bb26;">"memoir-org"</span> <span style="color: #b8bb26;">"memoir-static"</span><span style="color: #fb4934;">)</span><span style="color: #8ec07c;">)</span><span style="color: #fabd2f;">)</span><span style="color: #fb4934;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: frederic boileau</p>
<p class="date">Created: 2020-09-24 Thu 22:05</p>
</div>
</body>
</html>
